bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA16A4.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant name="ATXMEGA16A4-AU" package="TQFP44" speedmax="32000000" pinout="QFP_QFN_44" tempmax="0" tempmin="0" vccmax="3.6" vccmin="1.6"/>
        <variant name="ATXMEGA16A4-MH" package="VQFN44" speedmax="32000000" pinout="QFP_QFN_44" tempmax="0" tempmin="0" vccmax="3.6" vccmin="1.6"/>
    </variants>
    <device name="ATxmega16A4" family="AVR8" architecture="AVR8_XMEGA" avr-family="AVR XMEGA">
        <address-spaces>
            <address-space name="prog" id="prog" start="0x0000" size="0x5000" endianness="little">
                <memory-segment start="0x0000" size="0x4000" type="flash" rw="RW" exec="1" name="APP_SECTION" pagesize="256"/>
                <memory-segment start="0x3000" size="0x1000" type="flash" rw="RW" exec="1" name="APPTABLE_SECTION" pagesize="256"/>
                <memory-segment start="0x4000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION" pagesize="256"/>
            </address-space>
            <address-space name="data" id="data" start="0x0000" size="0x2800" endianness="little">
                <memory-segment start="0x0000" size="0x1000" type="io" rw="RW" exec="0" name="IO"/>
                <memory-segment start="0x1000" size="0x0400" type="eeprom" rw="RW" exec="0" name="MAPPED_EEPROM"/>
                <memory-segment start="0x2000" size="0x0800" type="ram" rw="RW" exec="0" name="INTERNAL_SRAM"/>
            </address-space>
            <address-space name="eeprom" id="eeprom" start="0x0000" size="0x0400">
                <memory-segment start="0x0000" size="0x0400" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="32"/>
            </address-space>
            <address-space name="signatures" id="signatures" start="0x0000" size="0x0003">
                <memory-segment start="0x0000" size="0x0003" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space name="fuses" id="fuses" start="0x0000" size="0x0006">
                <memory-segment start="0x0000" size="0x0006" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space name="lockbits" id="lockbits" start="0x0000" size="0x0001">
                <memory-segment start="0x0000" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space name="user_signatures" id="user_signatures" start="0x0000" size="0x0100">
                <memory-segment start="0x0000" size="0x0100" type="user_signatures" rw="RW" exec="0" name="USER_SIGNATURES" pagesize="256"/>
            </address-space>
            <address-space name="prod_signatures" id="prod_signatures" start="0x0000" size="0x0034">
                <memory-segment start="0x0000" size="0x0034" type="signatures" rw="R" exec="0" name="PROD_SIGNATURES" pagesize="256"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="GPIO" id="I6085">
                <instance name="GPIO">
                    <register-group address-space="data" offset="0x0000" name-in-module="GPIO" name="GPIO"/>
                </instance>
            </module>
            <module name="XOCD" id="I6043">
                <instance name="OCD">
                    <register-group address-space="data" offset="0x002E" name-in-module="OCD" name="OCD"/>
                </instance>
            </module>
            <module name="CPU" id="I6000">
                <instance name="CPU">
                    <register-group address-space="data" offset="0x0030" name-in-module="CPU" name="CPU"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V3X"/>
                    </parameters>
                </instance>
            </module>
            <module name="CLK" id="I6073">
                <instance name="CLK">
                    <register-group address-space="data" offset="0x0040" name-in-module="CLK" name="CLK"/>
                </instance>
                <instance name="PR">
                    <register-group address-space="data" offset="0x0070" name-in-module="PR" name="PR"/>
                </instance>
            </module>
            <module name="SLEEP" id="I6081">
                <instance name="SLEEP">
                    <register-group address-space="data" offset="0x0048" name-in-module="SLEEP" name="SLEEP"/>
                </instance>
            </module>
            <module name="OSC" id="I6079">
                <instance name="OSC">
                    <register-group address-space="data" offset="0x0050" name-in-module="OSC" name="OSC"/>
                </instance>
            </module>
            <module name="DFLL" id="I6055">
                <instance name="DFLLRC32M">
                    <register-group address-space="data" offset="0x0060" name-in-module="DFLL" name="DFLLRC32M"/>
                </instance>
                <instance name="DFLLRC2M">
                    <register-group address-space="data" offset="0x0068" name-in-module="DFLL" name="DFLLRC2M"/>
                </instance>
            </module>
            <module name="RST" id="I6083">
                <instance name="RST">
                    <register-group address-space="data" offset="0x0078" name-in-module="RST" name="RST"/>
                </instance>
            </module>
            <module name="WDT" id="I6078">
                <instance name="WDT">
                    <register-group address-space="data" offset="0x0080" name-in-module="WDT" name="WDT"/>
                </instance>
            </module>
            <module name="MCU" id="I6091">
                <instance name="MCU">
                    <register-group address-space="data" offset="0x0090" name-in-module="MCU" name="MCU"/>
                </instance>
            </module>
            <module name="PMIC" id="I6057">
                <instance name="PMIC">
                    <register-group address-space="data" offset="0x00A0" name-in-module="PMIC" name="PMIC"/>
